models/SignupForm.php

INSERT INTO `user` (`username`, `surname`, `email`, `birth_date`, `phone`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Kostya', 'Kostya', 'malenkokv@gmail.com', '1993-Jul-10', '0637303690', '$2y$13$dlYAHv8L1IEHupkEmRVQT.NzxPOsvGR3kEWqwaWU1nyoSoWta/pHS', 'yaF2upJ5T16ipfJyKyS27wcf_blFF3tv', 10, 1487331845, 1487331845)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->surname = $this->surname;
        $user->email = $this->email;
        $user->birth_date = $this->birth_date;
        $user->phone = $this->phone;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;